app/controllers/notes_controller.rb

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("created_at", "message", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 28 Jan 2015 02:29:50 UTC +00:00], ["message", "Hellow Menkey-League!"], ["name", "Wei"], ["updated_at", Wed, 28 Jan 2015 02:29:50 UTC +00:00]]